# Dotfiles symlink
brew "stow"

# CLI Tools
brew "mise"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "tree-sitter"
brew "eza"
brew "vivid"
brew "zoxide"

# TUI
brew "lazygit"

# Editor
brew "nvim"

# Dependencies
brew "imagemagick"
brew "ghostscript"
brew "tectonic"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "ghostty"
cask "codex"
