# Dotfiles symlink
brew "stow"

# CLI Tools
brew "mise"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "tree-sitter"
brew "ast-grep"
brew "eza"
brew "vivid"
brew "zoxide"
brew "wget"
brew "bat"

brew "docker"
brew "docker-compose"

# Shell Prompt
brew "starship"

# TUI
brew "lazygit"

# Editor
brew "nvim"

# Dependencies
brew "imagemagick"
brew "ghostscript"
brew "tectonic"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "ghostty"
cask "claude-code"
